post/auto-generate-blog-relative-info.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-02-24 Mon 12:48 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>自动生成org blog辅助信息</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kinney Zhang">

<link rel="shortcut icon" href="/static/img/favicon.ico"/>
<link rel="bookmark" href="/static/img/favicon.ico" type="image/x-icon"/>
<link id="pagestyle" rel="stylesheet" type="text/css" href="/static/light.css"/>
<!-- Google Analytics -->
<!-- End Google Analytics -->
</head>
<body>

<div id="org-div-header">
<div class="toptitle">
<span href="/post/index.html">Geekinney Blog</span>
<span onclick="switchTheme();">切换主题</span>
</div>
<div class="topnav">
<a href="/post/index.html">首页</a>&nbsp;|&nbsp;
<a href="/post/archive.html">归档</a>&nbsp;|&nbsp;
<a href="/post/category.html">分类</a>&nbsp;|&nbsp;
<a href="/post/friendly-link.html">友链</a>&nbsp;|&nbsp;
<a href="https://github.com/Kinneyzhang">Github</a>&nbsp;
</div>
</div><div id="content">
<header>
<h1 class="title">自动生成org blog辅助信息</h1>
</header><div class="org-center">
<p>
[ 分类: Emacs / 日期: 2020-02-21 / 字数: 1026 ]
</p>
</div>
<p>
一篇博客文章除了标题、正文，还有一些辅助的信息，比如：日期，分类，字数等。使用orgmode生成html不会自动生成这些内容，于是想hack一下。折腾效果如博文开头的：[ 分类: Emacs / 日期: 2020-02-21 / 字数: 1025 ]。
</p>

<p>
这里主要使用了orgMode的 <a href="https://orgmode.org/manual/Macro-Replacement.html">Macro Replacement</a> 功能。我们可以在org文件开头定义宏，然后在正文需要的位置调用宏就可以实现辅助信息的插入。
</p>

<p>
例如，定义如下宏：
</p>

<pre class="example">
#+MACRO: poem Rose is $1, violet's $2. Life's ordered: Org assists you.
</pre>

<p>
其中，"poem"为宏的名称，后面的内容为宏的内容，"$1，$2"为参数。然后在合适的位置调用宏：
</p>

<pre class="example">
{{{poem(red,blue)}}}
</pre>

<p>
最终的结果是在调用宏的位置插入"Rose is red, violet's blue. Life's ordered: Org assists you."。相信这种功能也不难理解，类似于函数的定义与调用。
</p>

<p>
除了插入一串字符，预先在org文件开头定义的一些keyword可以直接调用。也可以在宏中调用elisp函数，实现更为复杂的功能。blog辅助信息的生成就依赖这两个功能。为了实现上面的效果，我在文章开头插入了如下的宏调用：
</p>

<p>
<a id="org06210dc"></a>
</p>
<pre class="example">
#+begin_center
[ 分类: {{{keyword(category)}}} / 日期: {{{date}}} / 字数: {{{wc}}} ]
#+end_center
</pre>

<p>
其中 <code>{{{date}}}</code> 直接调用了 <code>#+DATE:</code> 预定义的日期， <code>{{{keyword(category)}}}</code> 调用了 <code>#+CATEGORY:</code> 预定义的分类。这里要说明的是，对于orgmode已有的keyword，如"TITLE, AUTHOR, DATE"这些可以直接调用。自定义的keyword如"CATEGORY"需要定义为形如 <code>{{{keyword(category)}}}</code> 的格式。最后，文章的字数需要使用一个elisp函数统计，这里需要定义一个统计字数的宏：
</p>

<pre class="example">
#+MACRO: wc (eval (my/word-count))
</pre>

<p>
不难理解，这个宏执行了 <code>my/word-count</code> 这个函数，然后插入到“字数：”后面。这个统计字数的函数定义如下：
</p>

<div class="col-auto">
<pre><code class="emacs-lisp">;; count words
(defvar wc-regexp-chinese-char-and-punc
  (rx (category chinese)))
(defvar wc-regexp-chinese-punc
  "[。，！？；：「」『』（）、【】《》〈〉※—]")
(defvar wc-regexp-english-word
  "[a-zA-Z0-9-]+")

(defun my/word-count ()
  "「較精確地」統計中/日/英文字數。
- 文章中的註解不算在字數內。
- 平假名與片假名亦包含在「中日文字數」內，每個平/片假名都算單獨一個字（但片假
  名不含連音「ー」）。
- 英文只計算「單字數」，不含標點。
- 韓文不包含在內。

※計算標準太多種了，例如英文標點是否算入、以及可能有不太常用的標點符號沒算入等
。且中日文標點的計算標準要看 Emacs 如何定義特殊標點符號如ヴァランタン・アルカン
中間的點也被 Emacs 算為一個字而不是標點符號。"
  (interactive)
  (let* ((v-buffer-string
	  (progn
	    (if (eq major-mode 'org-mode) ; 去掉 org 文件的 OPTIONS（以#+開頭）
		(setq v-buffer-string (replace-regexp-in-string "^#\\+.+" ""
								(buffer-substring-no-properties (point-min) (point-max))))
	      (setq v-buffer-string (buffer-substring-no-properties (point-min) (point-max))))
	    (replace-regexp-in-string (format "^ *%s *.+" comment-start) "" v-buffer-string)))
					; 把註解行刪掉（不把註解算進字數）。
	 (chinese-char-and-punc 0)
	 (chinese-punc 0)
	 (english-word 0)
	 (chinese-char 0))
    (with-temp-buffer
      (insert v-buffer-string)
      (goto-char (point-min))
      ;; 中文（含標點、片假名）
      (while (re-search-forward wc-regexp-chinese-char-and-punc nil :no-error)
	(setq chinese-char-and-punc (1+ chinese-char-and-punc)))
      ;; 中文標點符號
      (goto-char (point-min))
      (while (re-search-forward wc-regexp-chinese-punc nil :no-error)
	(setq chinese-punc (1+ chinese-punc)))
      ;; 英文字數（不含標點）
      (goto-char (point-min))
      (while (re-search-forward wc-regexp-english-word nil :no-error)
	(setq english-word (1+ english-word))))
    (setq chinese-char (- chinese-char-and-punc chinese-punc))
    ;;  (message
    ;;      (format "中日文字數（不含標點）：%s
    ;; 中日文字數（包含標點）：%s
    ;; 英文字數（不含標點）：%s
    ;; =======================
    ;; 中英文合計（不含標點）：%s"
    ;;              chinese-char chinese-char-and-punc english-word
    ;;              (+ chinese-char english-word)))
    (+ chinese-char english-word)))
</code></pre>
</div>

<p>
OK，这样每次在org发布项目的时候就会自动添加日期、分类和统计字数了。但是，每次在写blog的时候都要在开头加上<a href="#org06210dc">这一段内容</a>实在是麻烦。可以将这些内容放在单独的文件中，然后用 <code>#+INCLUDE:</code> 引入。
</p>

<p>
我将它们放在 <code>post-info.org</code> 这个文件中，完整的内容是：
</p>

<pre class="example">
#+MACRO: wc (eval (my/word-count))
#+begin_center
[ 分类: {{{keyword(category)}}} / 日期: {{{date}}} / 字数: {{{wc}}} ]
#+end_center
</pre>

<p>
然后在文章开头加上 <code>#+INCLUDE: "../code/post-info.org"</code> 即可。
</p>

<p>
注意：如果宏定义中执行的函数需要参数，一定要注意参数必须是字符串类型。比如参数中传入一个list，这个list就变成了字符串。在函数执行前需要先 <code>(read &lt;list&gt;)</code> 将字符串转为列表。
</p>
</div>
<div id="postamble" class="status">

<script src="/static/jQuery.min.js"></script>
<script src="/static/Valine.min.js"></script>
<script src="/static/highlight.min.js"></script>
<script>var hlf=function(){Array.prototype.forEach.call(document.querySelectorAll("pre.src"),function(t){var e;e=t.getAttribute("class").toLowerCase(),e=e.replace(/src-(w+)/,"src-$1 $1"),console.log(e),t.setAttribute("class",e),hljs.highlightBlock(t)})};addEventListener("DOMContentLoaded",hlf);</script>

<div id="vcomments"></div>
<script>
new Valine({
el: '#vcomments',
appId: 'jVMbXK6tJDtPCzR3Mp0V5L6V-gzGzoHsz',
appKey: 'SX4oRFXp8K7KgeGhKTTDy3VI',
visitor: true,
notify: true,
verify: false,
avatar: 'identicon',
placeholder: '留下你的评论吧～'
})
</script>
<p class="author">Author: Kinney Zhang (<a href="mailto:kinneyzhang666@gmail.com">kinneyzhang666@gmail.com</a>)</p>
<p class="date">Date: 2020-02-21</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>


<script>
$(document).ready(function(){
var theme = sessionStorage.getItem("theme");
if(theme=="dark"){
document.getElementById("pagestyle").href="/static/dark.css";
}else if(theme=="light"){
document.getElementById("pagestyle").href="/static/light.css";
}else{
sessionStorage.setItem("theme","light");
}});

function switchTheme(){
if(sessionStorage.getItem("flag")=="false"){
document.getElementById("pagestyle").href="/static/light.css";
sessionStorage.setItem("theme","light");
sessionStorage.setItem("flag", "true");
}else{
document.getElementById("pagestyle").href="/static/dark.css";
sessionStorage.setItem("theme","dark");
sessionStorage.setItem("flag", "false");
}};
</script>
</div>
</body>
</html>
